# Заявки на трансграничную передачу данных ООО "ЭхоГолос"
import datetime

заявки_на_передачу = [
    {
        "номер": 1,
        "страна_получатель": "KZ", # Казахстан (достаточная защита)
        "виды_данных": ["иные"],
        "число_людей": 5000,
        "цель": "Запись подкастов в филиале",
        "есть_согласие": True,
        "уведомлен_РКН": True,
        "дата_уведомления": "2026-10-01",
        "текущая_дата": "2026-10-17"
    },
    {
        "номер": 2,
        "страна_получатель": "US", # США (без защиты)
        "виды_данных": ["биометрические", "иные"],
        "число_людей": 2000,
        "цель": "Аналитика голосовых данных через облако",
        "есть_согласие": True,
        "уведомлен_РКН": False,
        "дата_уведомления": None,
        "текущая_дата": "2026-10-17"
    },
    {
        "номер": 3,
        "страна_получатель": "CN", # Китай (особый режим)
        "виды_данных": ["специальные", "иные"],
        "число_людей": 10000,
        "цель": "Научные исследования",
        "есть_согласие": False,
        "уведомлен_РКН": True,
        "дата_уведомления": "2026-10-15",
        "текущая_дата": "2026-10-17"
    }
]
# 7 * 7 = 49
